{"pages":[{"title":"","text":"","link":"/about/index.html"}],"posts":[{"title":"github &amp; git 사용법","text":"GIT은 무엇인가깃(git)은 컴퓨터 파일의 변경사항을 추적하고 여러 명의 사용자들 간에 해당 파일들의 작업을 조율하기 위한 분산 버전 관리 시스템입니다. 출처 위키피디아 그렇다고 한다 그렇다면 깃(git)과 깃허브(github)는 무슨 관계일까요깃허브는 gitlab,bitbucket 등과 같이 대표적인 git 저장소입니다. github 회원가입먼저 github 홈페이지에 들어가 줍니다 그리고 우측 상단에 있는 signup 버튼을 눌러 계정을 생성해 줍니다 깃허브 레파지토리 만들기회원가입을 완료했으면 좌측 상단 Repositories 라고 적혀있는 곳 옆에 new 버튼을 눌러 레파지토리를 생성해 줍니다 Repository name 이라고 적힌곳에는 레파지토리의 이름을, Description 이라고 적힌곳에는 레파지토리의 설명을 적어주시면 됩니다 Public 과 private 을 고를수 있는데Public 으로 설정하시면 다른 사람이 당신의 레파지토리를 볼수 있고 private 으로 하면 다른 사람들이 보지 못합니다. git 다운로드 &amp; 최초 설정자 여기까지는 깃허브(github)를 회원가입하고 레파지토리를 만들어 봤는데요. 이번엔 git 을 설치하여 레파지토리를 clone 하고 remote 해보도록 하겟습니다 먼저 git 홈페이지에 들어가 우측에 있는 다운로드 버튼을 눌러 설치를 해줍니다. 설치가 완료되었으면 window 키를 누르고 git bash 를 입력, 엔터를 눌러 실행해줍니다 아니면 원하는 폴더에 가서 우클릭을 하고 git bash here를 눌러줍니다 그러면 이런 창이 하나 뜰텐데 처음으로 해야 할 일은 사용자 정보 등록입니다 사용자 정보Git을 설치하고 나서 가장 먼저 해야 하는 것은 사용자이름과 이메일 주소를 설정하는 것이다. Git은 커밋할 때마다 이 정보를 사용한다. 한 번 커밋한 후에는 정보를 변경할 수 없다. git 공식 문서 $ git config --global user.name &quot;자신의 이름&quot;$ git config --global user.email 자신의@이메일 을 입력해줍니다 그리고 $ git config --list 으로 확인할 수도 있습니다 git 저장소 만들고 remote 하기아까 폴더에서 git bash here 을 이용해 연 사람들은 넘어가고 git bash를 그냥 연 사람들은 cd 명령어를 이용해 자신이 원하는 폴더로 가줍니다 원하는 폴더에 도착했으면 $ git init 를 이용해 새로운 git저장소를 만든 다음 숨긴 항목을 표시하면 다음과 같이 .git 폴더가 생성되어있는것을 확인하실수 있습니다 그럼 이제 리모트 저장소를 추가할 차례입니다(remote) $ git remote add 저장소 주소.gitex)$ git remote add origin https://github.com/유저명/레파지토리.git 이렇게 아까 생성한 깃허브 레파지토리를 remote 해줍니다 ###git remote 추가 명령어 commit 추가하거나 바뀐 파일을 $ git add &lt;filename&gt;으로 커밋해줍니다 파일이 여러개라면 $ git add *으로 모두 커밋합니다 ex)$ git commit -m &quot;커밋 메세지&quot;로 커밋해줍니다 하지만 이렇게 해서는 원격 저장소에 아무 영향이 가지 않습니다 원격 저장소에 push 하기 $ git push origin &lt;branch명&gt; 으로 push 해줍니다 ex)$ git push origin master master branch로 push하고싶으면 이렇게 하면 됩니다 이런 창이 뜨면 로그인 해주시면 됩니다 그 후 깃허브에 가셔서 레파지토리 확인해보시면 변경되어 있는것을 확인하실수 있습니다 https://github.com/ https://git-scm.com/ https://ko.wikipedia.org/wiki/%EA%B9%83%ED%97%88%EB%B8%8C https://ko.wikipedia.org/wiki/%EA%B9%83_(%EC%86%8C%ED%94%84%ED%8A%B8%EC%9B%A8%EC%96%B4) https://git-scm.com/doc","link":"/2021/03/22/github%20&%20git%20%EC%82%AC%EC%9A%A9%EB%B2%95/"}],"tags":[{"name":"github","slug":"github","link":"/tags/github/"},{"name":"git","slug":"git","link":"/tags/git/"}],"categories":[{"name":"개발","slug":"개발","link":"/categories/%EA%B0%9C%EB%B0%9C/"},{"name":"github","slug":"개발/github","link":"/categories/%EA%B0%9C%EB%B0%9C/github/"}]}